app/Controllers/Home.php

    public function insert()
    {
        //echo "Data insert";
        $email=$this->request->getVar('email');
        $password=$this->request->getVar('password');
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);
        $data=['email'=>$email,'password' => $hashedPassword
    ];
    $db = \Config\Database::connect();
             $builder = $db->table('users');
             $builder->insert($data);
---
INSERT INTO `users` (`email`, `password`) VALUES ('krishna026@gmail.com', '$2y$10$4OgWowZazqrv8IFwGV3qEu8Q.tapK/jsSRT9OIMRp1e1aLLgAa/by')